/*************************************************************************
	> File Name: 8.define.c
	> Author: 任博宇 
	> Mail: renboyu@hrbeu.edu.cn / renboyu2333@gmail.com
	> Created Time: Tue Sep 21 09:36:28 2021
 ************************************************************************/

#include <stdio.h>

#define MAX(a, b) ({ \
    __typeof(a) _a = (a); \
    __typeof(b) _b = (b); \
    _a > _b ? _a : _b; \
    })
// 这样利用两个中间变量，就可以实现只对a, b计算一次并且返回正确的a++或者b++
#define P(a) { \
    printf("%s = %d\n", #a, a); \
    }
// 宏P可以输出a和a对应的宏表达式#a
// 通过第一遍输出我们发现出了第一个剩下的都错了
// gcc -E 可以展示编译前的最终代码
// { printf("%s = %d\n", "5 + MAX(2, 3)", 5 + 2 > 3 ? 2 : 3); };
// 变成了7 > 3 ? 2 : 3 = 2;
// 解决这个问题要给每个变量加上括号,保证运算顺序
// 改好了 但是最后一个又不对了
// 将MAX改成多行表达式
int main() {
    int a = 7;
    P(a);
    P(MAX(2, 3));
    P(5 + MAX(2, 3));
    P(MAX(2, MAX(3, 4)));
    P(MAX(2, 3 > 4 ? 3 : 4));
    P(MAX(a++, 6));
    P(a);
    return 0;
}
